{
  "feed": "guardian_edu",
  "items": [
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "Some schools in England taking up to six times more special needs pupils than others",
      "link": "https://www.theguardian.com/education/2025/nov/13/schools-steer-away-special-needs-pupils-research-finds",
      "guid": "https://www.theguardian.com/education/2025/nov/13/schools-steer-away-special-needs-pupils-research-finds",
      "pubDate": "2025-11-13T07:02:13.000Z",
      "summary": "Findings come as government prepares white paper to urgently overhaul provision and funding\nSchools in England are steering away children with special needs, leading some to have six times as many pupils requiring learning or behaviour support compared with others, according to research.\nLocal authority leaders told the National Foundation for Educational Research (NFER) they knew of schools that were “happy” to see others take children requiring extra support detailed by education, health and care plans (EHCPs), including headteachers who feared the impact on exam results of enrolling children with special needs.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "‘I really enjoyed it’: new RSC curriculum brings Shakespeare’s works to life in UK classrooms",
      "link": "https://www.theguardian.com/culture/2025/nov/12/new-rsc-curriculum-shakespeare-uk-schools-macbeth",
      "guid": "https://www.theguardian.com/culture/2025/nov/12/new-rsc-curriculum-shakespeare-uk-schools-macbeth",
      "pubDate": "2025-11-12T09:00:20.000Z",
      "summary": "Starting with Macbeth, online platform using rehearsal-based teaching methods aims to transform study of the Bard\nAct 1. Scene 1. A classroom in a secondary school in Peterborough. It is a dreary, wet afternoon. Pupils file into the room, take their seats and face the front.\nThese year 10 English students at Ormiston Bushfield academy are taking part in a workshop about Macbeth, part of a new curriculum devised by the Royal Shakespeare Company (RSC) to bring the Bard’s works to life in the UK’s slightly stuffy classrooms.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "All schools in England to be given AI-generated pupil attendance targets",
      "link": "https://www.theguardian.com/education/2025/nov/12/all-schools-in-england-to-be-given-ai-generated-pupil-attendance-targets",
      "guid": "https://www.theguardian.com/education/2025/nov/12/all-schools-in-england-to-be-given-ai-generated-pupil-attendance-targets",
      "pubDate": "2025-11-12T00:01:09.000Z",
      "summary": "Unions decry move, saying it will put more pressure on headteachers without tackling absence from classrooms\nEvery school in England is to be issued with an AI-generated target for minimum pupil attendance, the government has announced, as part of its continuing efforts to tackle absence in the country’s classrooms.\nHeadteachers will be given the targets this month in an effort to boost attendance rates, which remain stubbornly below pre-pandemic levels.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "UK 18- to 24-year-olds: we would like to hear your experiences of trying to find a job",
      "link": "https://www.theguardian.com/society/2025/nov/11/uk-18-24-year-olds-experiences-trying-to-find-a-job",
      "guid": "https://www.theguardian.com/society/2025/nov/11/uk-18-24-year-olds-experiences-trying-to-find-a-job",
      "pubDate": "2025-11-11T12:33:29.000Z",
      "summary": "Persistently high numbers of 16- to 24-year-olds are not in work or studying in the UK\nAlmost a million young people in the UK are not in education, employment or training (Neet).\nThis week, the government announced the launch of an independent investigation into the issue, which Secretary of State for Work and Pensions, Pat McFadden has called a “crisis of opportunity”.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "Girl, 17, joins lawsuit against UK government after seeing horrific phone videos at school",
      "link": "https://www.theguardian.com/education/2025/nov/10/girl-17-joins-lawsuit-against-government-after-seeing-horrific-phone-videos-at-school",
      "guid": "https://www.theguardian.com/education/2025/nov/10/girl-17-joins-lawsuit-against-government-after-seeing-horrific-phone-videos-at-school",
      "pubDate": "2025-11-10T07:05:13.000Z",
      "summary": "Flossie McShea from Devon says she saw a shooting, a beheading and porn and that other students ‘show you their screen without invitation’\nA 17-year-old girl who says she was exposed to horrific images and videos including porn, a shooting and a beheading on a smartphones during the school day has joined a legal action against the education secretary.\nFlossie McShea, from Devon, says she also received threatening messages while at school, as she put her name to a judicial review in an attempt to get smartphones banned in schools in England.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "Royal College of Psychiatrists faces member backlash over Qatar partnership",
      "link": "https://www.theguardian.com/society/2025/nov/09/royal-college-of-psychiatrists-faces-member-backlash-over-qatar-partnership",
      "guid": "https://www.theguardian.com/society/2025/nov/09/royal-college-of-psychiatrists-faces-member-backlash-over-qatar-partnership",
      "pubDate": "2025-11-09T06:00:25.000Z",
      "summary": "More than 150 psychiatrists sign letter condemning contract to host exams in country with well-documented human rights abuses\nThe Royal College of Psychiatrists is facing a backlash from members over a controversial partnership with Qatar’s state healthcare provider.\nThe college has signed a contract with the state-owned Hamad Medical Corporation to host international exams in Doha, enabling psychiatrists from across the Middle East and beyond to apply for membership.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "Students and faculty at over 100 US universities protest against Trump’s attacks",
      "link": "https://www.theguardian.com/us-news/2025/nov/07/student-protest-trump-education-attacks",
      "guid": "https://www.theguardian.com/us-news/2025/nov/07/student-protest-trump-education-attacks",
      "pubDate": "2025-11-07T20:05:32.000Z",
      "summary": "Student, national and local groups across US organized day of action to condemn Trump’s assault on academic freedom\nStudents, faculty and staff at more than 100 campuses across the US rallied against the Trump administration’s assault on higher education on Friday – the first in a planned series of nationwide, coordinated protests that organizers hope will culminate in large-scale students’ and workers’ strikes next May Day and a nationwide general strike in May 2028.\nThe day of action was organized under the banner of Students Rise Up, a network of students including both local groups and national organizations such as Sunrise Movement and Campus Climate Network. Students were joined by faculty and educational workers’ unions like the American Association of University Professors and Higher Education Labor United.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "The Guardian University Guide 2026 – the rankings",
      "link": "https://www.theguardian.com/education/ng-interactive/2025/sep/13/the-guardian-university-guide-2026-the-rankings",
      "guid": "https://www.theguardian.com/education/ng-interactive/2025/sep/13/the-guardian-university-guide-2026-the-rankings",
      "pubDate": "2025-09-13T07:01:01.000Z",
      "summary": "Find a course at one of the top universities in the country. Our league tables rank them all subject by subject, as well as by student satisfaction, staff numbers, spending and career prospects\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "‘You just have to laugh’: five teachers on dealing with ‘six-seven’ in the classroom",
      "link": "https://www.theguardian.com/education/2025/oct/25/you-just-have-to-laugh-five-teachers-on-dealing-with-six-seven-in-the-classroom",
      "guid": "https://www.theguardian.com/education/2025/oct/25/you-just-have-to-laugh-five-teachers-on-dealing-with-six-seven-in-the-classroom",
      "pubDate": "2025-10-25T08:39:11.000Z",
      "summary": "Children across the UK have been shouting out ‘six-seven’ during lessons. How are teachers reacting?\nAcross the UK, school pupils have been shouting out the words “six-seven” during lessons in the latest meme-based craze to sweep through classrooms.\nWhile some teachers have chosen to stoically ignore the trend, others have embraced it. Five teachers explain how they’re coping.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "‘Publicly humiliated’: parents describe difficulty of children’s isolation at school",
      "link": "https://www.theguardian.com/education/2025/oct/23/publicly-humiliated-parents-describe-difficulty-of-childrens-isolation-at-school",
      "guid": "https://www.theguardian.com/education/2025/oct/23/publicly-humiliated-parents-describe-difficulty-of-childrens-isolation-at-school",
      "pubDate": "2025-10-23T05:00:59.000Z",
      "summary": "Parents say use of isolation room damages mental health and children’s learning\n\nOne in 12 secondary pupils put in isolation rooms at least once a week, study finds\n\nMax was 11 and had just started his new secondary school when he was first put into isolation. He had asked to use the toilet between lessons, which was not ordinarily allowed, and was told to go quickly.\n“He knew he wasn’t allowed to run, so he walked quickly,” his mother, Beth, told the Guardian. But teachers claimed he was running and Max’s secondary school career began with a week’s isolation.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "Happy, stressed, overwhelmed: Palestinians evacuated from Gaza start their studies in UK",
      "link": "https://www.theguardian.com/education/2025/oct/09/palestinians-evacuated-gaza-studies-uk-universities",
      "guid": "https://www.theguardian.com/education/2025/oct/09/palestinians-evacuated-gaza-studies-uk-universities",
      "pubDate": "2025-10-09T06:00:18.000Z",
      "summary": "Abdallah, 27, and Soha, 31, describe adjusting to their new lives after leaving their war-torn home\nThe young man emerging from a backstreet accommodation block in a bustling corner of east London looks much like any other student, getting to grips with his studies at the start of a new term. But 27-year-old Abdallah carries more of a burden than most. A qualified doctor, he has recently been evacuated from Gaza to begin his studies at Queen Mary University of London on a fully funded, government-backed Chevening scholarship.\nAs well as his work in hospitals, he has been striving for months on behalf of the dozens of Palestinian scholars like himself who have been stranded in war-torn Gaza awaiting evacuation by the British government to take up places in UK universities.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "‘We’ve been inundated’: European private schools report surge in interest from wealthy British parents",
      "link": "https://www.theguardian.com/education/2025/oct/04/weve-been-inundated-european-private-schools-report-surge-in-interest-from-wealthy-british-parents",
      "guid": "https://www.theguardian.com/education/2025/oct/04/weve-been-inundated-european-private-schools-report-surge-in-interest-from-wealthy-british-parents",
      "pubDate": "2025-10-04T07:00:05.000Z",
      "summary": "VAT on school fees has led to a rise in overseas interest and even relocations as UK fees have jumped by as much as 22.6%\nWealthy British parents are turning to boarding schools in continental Europe as rising private school fees push families to look for cheaper options abroad.\nGerman and Swiss institutions have reported rises in the number of queries from British parents who face higher fees at home, after the Labour government imposed 20% VAT on private education from January.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "The Guardian view on education reform: Labour risks missing its chance to change schools | Editorial",
      "link": "https://www.theguardian.com/commentisfree/2025/nov/10/the-guardian-view-on-education-reform-labour-risks-missing-its-chance-to-change-schools",
      "guid": "https://www.theguardian.com/commentisfree/2025/nov/10/the-guardian-view-on-education-reform-labour-risks-missing-its-chance-to-change-schools",
      "pubDate": "2025-11-10T19:15:52.000Z",
      "summary": "Ministers should encourage teachers who are keen to try new things before the new curriculum’s formal adoption\nMuch better to defer a white paper on special needs education in England than to announce plans in haste, only to be forced to withdraw them. This was the calculation behind the government’s decision to put off until next year its plans for reform in a vitally important and sensitive area. Some council leaders were disappointed by the delay, such is their desperation about overspends. But ministers hope that further consultation will enable them to gather support for proposals that they insist are aimed at improving the system by making mainstream schools more inclusive – and not, as many families fear, reducing entitlements and saving money.\nThe postponement was probably prudent. But as details of last week’s Francis review on the curriculum sink in, it is clear that the government has work to do in maintaining a sense of momentum around its plans for education. The changes to GCSE content and exams set out in the report, which were mostly accepted by Bridget Phillipson, will take effect from 2029, which is after the next general election. Pupils who are currently in their last year of primary school (aged 10 and 11) will be the first to take the refreshed courses. Changes to the national curriculum will take effect a year earlier.\nDo you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "My verdict on the 'woke' review of England's school curriculum? It isn't radical enough | Simon Jenkins",
      "link": "https://www.theguardian.com/commentisfree/2025/nov/07/review-england-schools-curriculum-radical-michael-gove",
      "guid": "https://www.theguardian.com/commentisfree/2025/nov/07/review-england-schools-curriculum-radical-michael-gove",
      "pubDate": "2025-11-07T08:00:20.000Z",
      "summary": "When I heard it was dumbing down education, my heart sank. In fact, it’s outspoken about the chaos of Michael Gove’s reforms and the changes needed\nSchooling in Britain today is where medicine was in the days of bleeding and leeches. It is trapped in the past, between teachers wedded to their subjects and politicians obsessed with tests. Doctors generally know if they have cured you, lawyers know if you are found not guilty. Educators have only exams to measure their professional success. The result is that English schools cower beneath an examination mountain – a global outlier in terms of the volume of assessment.\nThis week’s report on reforming the curriculum in England was greeted by conservative critics with cries of wokery, dumbing down and falling standards. My heart sank, until I read its 200 pages. As a former education correspondent, I can only say I found it uplifting. There was the odd reference to diversity but it was hardly “woke”. What shocked me was its outspoken commentary on the existing system, a curriculum that is overly academic and culturally barren, and with teachers treated as robots.\nSimon Jenkins is a Guardian columnist\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "The Guardian view on the Francis curriculum review: raising the right questions in a world with few certain answers | Editorial",
      "link": "https://www.theguardian.com/commentisfree/2025/nov/05/the-guardian-view-on-the-francis-curriculum-review-raising-the-right-questions-in-a-world-with-few-certain-answers",
      "guid": "https://www.theguardian.com/commentisfree/2025/nov/05/the-guardian-view-on-the-francis-curriculum-review-raising-the-right-questions-in-a-world-with-few-certain-answers",
      "pubDate": "2025-11-05T18:30:13.000Z",
      "summary": "In an age of increasingly capable machines, it makes sense for schools to value creativity and life skills as part of a well-rounded education\nSocieties evolve and schools are under pressure to adapt, but some features of education policy are perennial. For example, modernisation will always be denounced as a dilution of standards. Inevitably, Conservatives have leapt on recommendations by an independent review, commissioned by the government, as proof that Bridget Phillipson, the education secretary, is “dumbing down” the curriculum.\nThe basis of these charges is that the review, led by Becky Francis, professor of education at University College London, proposes reducing the burden of GCSE exams and scrapping the English baccalaureate – a cluster of subjects that, when taken together, constitute a metric of success recognised in school league tables. Conservatives are also unhappy about the notion that primary schoolchildren should learn about the climate crisis and be encouraged to value diversity.\nDo you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here.\n Continue reading...",
      "image": null
    },
    {
      "sourceKey": "guardian_edu",
      "source": "Education | The Guardian",
      "title": "I’m a teenager who was lured into the manosphere. Here’s how to reach young men like me | Josh Sargent",
      "link": "https://www.theguardian.com/commentisfree/2025/nov/02/teenage-radicalised-manosphere-young-men-masculinity",
      "guid": "https://www.theguardian.com/commentisfree/2025/nov/02/teenage-radicalised-manosphere-young-men-masculinity",
      "pubDate": "2025-11-02T15:32:20.000Z",
      "summary": "Masculinity is almost always presented as toxic on my feed – but we need constructive alternatives to give hope to those who feel lost\nIf you judged modern boyhood from the headlines, you’d think we were broken – radicalised, misogynistic, angry. But as a teenage boy myself, I don’t see a generation of lost boys around me. I see young men trying to make sense of a world that seems apathetic to our voices.\nI’d be the first to admit that there are serious issues facing young men my age – I’ve experienced some of them first-hand. Between the ages of 12 and 14, I was drawn into harmful online communities promising me money, meaning and manhood. Muscular, wealthy men, parading through Dubai draped in designer labels and flanked by beautiful women flooded my feed. They said there was no excuse for the rest of us not to be in their position too, and offered what they claimed was a blueprint to get us there. Misogyny was rife in these communities, as was political extremism.\nJosh Sargent is a Year 11 student and writer who campaigns around masculinity and online spaces\nDo you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here.\n Continue reading...",
      "image": null
    }
  ]
}