{
  "feed": "hechinger",
  "items": [
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "How young is too young for gifted testing?",
      "link": "https://hechingerreport.org/how-young-is-too-young-for-gifted-testing/",
      "guid": "https://hechingerreport.org/?p=113347",
      "pubDate": "2025-11-13T15:03:06.000Z",
      "summary": "In New Orleans, a few hundred dollars could once help a family buy a “gifted” designation for their preschooler. As an education reporter for the city’s Times-Picayune newspaper several years ago, I discovered that there was a two-tiered system for determining whether 3-year-olds met that mark, which, in New Orleans, entitled them to gifted-only prekindergarten […]\nThe post How young is too young for gifted testing? appeared first on The Hechinger Report.",
      "image": null
    },
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "Advocates warn of risks to higher ed data if Education Department is shuttered",
      "link": "https://hechingerreport.org/proof-points-risks-higher-ed-data/",
      "guid": "https://hechingerreport.org/?p=113283",
      "pubDate": "2025-11-10T11:00:00.000Z",
      "summary": "Even with the government shut down, lots of people are thinking about how to reimagine federal education research. Public comments on how to reform the Institute of Education Sciences (IES), the Education Department’s research and statistics arm, were due on Oct. 15. A total of 434 suggestions were submitted, but no one can read them […]\nThe post Advocates warn of risks to higher ed data if Education Department is shuttered appeared first on The Hechinger Report.",
      "image": null
    },
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "OPINION: Too many college graduates are stranded before their careers can even begin. We can’t let that happen",
      "link": "https://hechingerreport.org/opinion-too-many-college-graduates-are-stranded-before-their-careers-can-even-begin-we-cant-let-that-happen/",
      "guid": "https://hechingerreport.org/?p=113298",
      "pubDate": "2025-11-10T06:00:00.000Z",
      "summary": "This fall, some 19 million undergraduates returned to U.S. campuses with a long-held expectation: Graduate, land an entry-level job, climb the career ladder. That formula is breaking down.   Once reliable gateway jobs for college graduates in industries like finance, consulting and journalism have tightened requirements. Many entry-level job postings that previously provided initial working experience […]\nThe post OPINION: Too many college graduates are stranded before their careers can even begin. We can’t let that happen appeared first on The Hechinger Report.",
      "image": null
    },
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "Trump administration cuts canceled this college student’s career start in politics",
      "link": "https://hechingerreport.org/trump-administration-cuts-canceled-this-college-students-career-start-in-politics/",
      "guid": "https://hechingerreport.org/?p=113292",
      "pubDate": "2025-11-10T06:00:00.000Z",
      "summary": "This story was produced in partnership with Teen Vogue and reprinted with permission.  Christopher Cade wants to be president someday. His inspiration largely comes from family members, who have been involved in local politics and activism since long before he was born. But policies from the Trump administration and the Ohio Legislature are complicating his […]\nThe post Trump administration cuts canceled this college student’s career start in politics appeared first on The Hechinger Report.",
      "image": null
    },
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "Federal policies risk worsening an already dire rural teacher shortage",
      "link": "https://hechingerreport.org/federal-policies-risk-worsening-an-already-dire-rural-teacher-shortage/",
      "guid": "https://hechingerreport.org/?p=113282",
      "pubDate": "2025-11-07T06:00:00.000Z",
      "summary": "HALIFAX COUNTY, N.C. — When Ivy McFarland first traveled from her native Honduras to teach elementary Spanish in North Carolina, she spent a week in Chapel Hill for orientation. By the end of that week, McFarland realized the college town on the outskirts of Raleigh was nowhere near where she’d actually be teaching. On the […]\nThe post Federal policies risk worsening an already dire rural teacher shortage appeared first on The Hechinger Report.",
      "image": null
    },
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "The new reality with universal school vouchers: Homeschoolers, marketing, pupil churn",
      "link": "https://hechingerreport.org/universal-vouchers-have-public-schools-worried-about-something-new-market-share/",
      "guid": "https://hechingerreport.org/?p=113229",
      "pubDate": "2025-11-06T06:00:00.000Z",
      "summary": "TALLAHASSEE, Fla. — As principal of Hartsfield Elementary School in the Leon County School District, John Olson is not just the lead educator, but in this era of fast-expanding school choice, also its chief salesperson. He works to drum up enrollment by speaking to parent and church groups, offering private tours and giving Hartsfield parents […]\nThe post The new reality with universal school vouchers: Homeschoolers, marketing, pupil churn appeared first on The Hechinger Report.",
      "image": null
    },
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "Climate change ‘is the new liberal arts’: Colleges build environmental lessons into degrees",
      "link": "https://hechingerreport.org/climate-change-is-the-new-liberal-arts-colleges-build-environmental-lessons-into-degrees/",
      "guid": "https://hechingerreport.org/?p=113195",
      "pubDate": "2025-11-05T06:00:00.000Z",
      "summary": "LA JOLLA, Calif. — On a Thursday this fall, hundreds of students at the University of California, San Diego, were heading to classes that, at least on paper, seemed to have very little to do with their majors.  Hannah Jenny, an economics and math major, was on their way to a class on sustainable development. […]\nThe post Climate change ‘is the new liberal arts’: Colleges build environmental lessons into degrees appeared first on The Hechinger Report.",
      "image": null
    },
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "Students worried about getting jobs are adding extra majors",
      "link": "https://hechingerreport.org/students-worried-about-getting-jobs-extra-majors/",
      "guid": "https://hechingerreport.org/?p=113148",
      "pubDate": "2025-11-05T06:00:00.000Z",
      "summary": "After he graduates from the University of Wisconsin-Madison, Drew Wesson hopes to begin a career in strategic communication, a field with higher-than-average job growth and earnings. One year into his time at the university, Wesson became more strategic about this goal. Like nearly 1 in 3 of his classmates, he declared a second major to […]\nThe post Students worried about getting jobs are adding extra majors appeared first on The Hechinger Report.",
      "image": null
    },
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "OPINION: The new AI tools are fast but can’t replace the judgment, care and cultural knowledge teachers bring to the table",
      "link": "https://hechingerreport.org/opinion-the-new-ai-tools-are-fast-but-cant-replace-the-judgment-care-and-cultural-knowledge-teachers-bring-to-the-table/",
      "guid": "https://hechingerreport.org/?p=113191",
      "pubDate": "2025-11-04T06:00:00.000Z",
      "summary": "The year I co-taught world history and English language arts with two colleagues, we were tasked with telling the story of the world in 180 days to about 120 ninth graders. We invited students to consider how texts and histories speak to one another: “The Analects” as imperial governance, “Sundiata” as Mali’s political memory, “Julius […]\nThe post OPINION: The new AI tools are fast but can’t replace the judgment, care and cultural knowledge teachers bring to the table appeared first on The Hechinger Report.",
      "image": null
    },
    {
      "sourceKey": "hechinger",
      "source": "The Hechinger Report",
      "title": "What research says about Mamdani and Cuomo’s education proposals",
      "link": "https://hechingerreport.org/proof-points-nyc-mayor-election-education/",
      "guid": "https://hechingerreport.org/?p=113202",
      "pubDate": "2025-11-03T11:00:00.000Z",
      "summary": "New York City, where I live, will elect a new mayor Tuesday, Nov. 4. The two front runners — state lawmaker Zohran Mamdani, the Democratic nominee, and former Gov. Andrew Cuomo, running as an independent — have largely ignored the city’s biggest single budget item: education.  One exception has been gifted education, which has generated […]\nThe post What research says about Mamdani and Cuomo’s education proposals appeared first on The Hechinger Report.",
      "image": null
    }
  ]
}